Catalogs/СтатусыPDM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтатусыPDM</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IconName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WorkflowID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СтатусыPDM/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗагрузитьСтатусыИзPDM(Команда)
	ОписаниеОшибки = ЗагрузитьСтатусыНасервере();
	Элементы.Список.Обновить();
	
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		Сообщить(ОписаниеОшибки);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗагрузитьСтатусыНасервере()

	ДанныеЗапроса = омPDMНаСервере.ПолучитьСтатусыПрямымЗапросом();
	
	Если ПустаяСтрока(ДанныеЗапроса.ОписаниеОшибки) Тогда
		
		мКодыСтатусов = Новый Массив;
		
		Для каждого х Из ДанныеЗапроса.Результат Цикл 
			
			мКодыСтатусов.Добавить(х.StatusID);
			
		КонецЦикла; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыPDM.Наименование КАК Name,
		|	СтатусыPDM.IconName КАК IconName,
		|	СтатусыPDM.WorkflowID КАК WorkflowID,
		|	СтатусыPDM.Код КАК StatusID,
		|	СтатусыPDM.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтатусыPDM КАК СтатусыPDM
		|ГДЕ
		|	СтатусыPDM.Код В(&Код)";
		
		Запрос.УстановитьПараметр("Код", мКодыСтатусов);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		КоличествоЭлементов = ДанныеЗапроса.Результат.Количество() - 1;
		
		Пока Выборка.Следующий() Цикл
			
			Для х = 0 По КоличествоЭлементов Цикл 
				
				ЭлементPDM = ДанныеЗапроса.Результат[х];
			
				Если ЭлементPDM.StatusID = Выборка.StatusID Тогда
					
					СправочникНайден = Истина;
					
					Если НЕ (ЭлементPDM.Name = Выборка.Name И ЭлементPDM.IconName = Выборка.IconName И ЭлементPDM.WorkflowID = Выборка.WorkflowID) Тогда
						
						ОбъектСправочник 			= ЭлементPDM.Ссылка;
						ОбъектСправочник.IconName 	= ЭлементPDM.IconName;
						ОбъектСправочник.Name 		= ЭлементPDM.Name;
						ОбъектСправочник.WorkflowID = ЭлементPDM.WorkflowID;
						
						ОбъектСправочник.Записать();
						
					КонецЕсли; 
					
					ДанныеЗапроса.Результат.Удалить(х);
					
					Прервать;
					
				КонецЕсли;	
				
			КонецЦикла;
			
			
		КонецЦикла;
		
	Иначе
		Возврат ДанныеЗапроса.ОписаниеОшибки;
	КонецЕсли;
	
	Для каждого х Из ДанныеЗапроса.Результат Цикл
		
		ОбъектСправочник = Справочники.СтатусыPDM.СоздатьЭлемент();
		
		ОбъектСправочник.Код 			= х.StatusID;
		ОбъектСправочник.Наименование	= х.Name;
		ОбъектСправочник.IconName 		= х.IconName;
		ОбъектСправочник.WorkflowID 	= х.WorkflowID;
		
		ОбъектСправочник.Записать();
		
	КонецЦикла;
	
КонецФункции // ЗагрузитьСтатусыНасервере()
